// Урок 1. Знакомство с языком программирования С#




// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел


Console.WriteLine("Введите первое число: ");
    int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
    int secondNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите третье число: ");
    int thirdNumber = Convert.ToInt32(Console.ReadLine());    

    int max = firstNumber;

    if (secondNumber > max)
    {
        max = secondNumber;        
    }
    
    if (thirdNumber > max)
    {
        max = thirdNumber;
        Console.WriteLine($"Максимальное значение - {+max} ");
    
    }